[
	{
        "type": "EE",
        "title": "Superset Adder",
        "tagline": "Low-power, high-speed, reliable addition using unreliable components",
        "description": "The superset adder subsumes all traditional radix-2 FO2 parallel prefix adders into one redundant design. This redundancy, combined with full controllability, enables the adder to reconfigure itself around nodes which are faulty, slow, or leaky. An extra row of prefix calculations appended to the adder allows the processor to detect errors during operation. The new design takes advantage of its controllability to reduce design margins, correct for errors, and maintain a competitive area overhead for its features.",
        "img_source": "images/project_superset.png",
        "img_alt": "Superset Adder Diagram",
		"color": "aqua",
        "dates": "2011-2012",
		"featured": "no",
        "documents": [
 			"http://dx.doi.org/10.1109/ISCAS.2012.6271457|A new taxonomy for reconfigurable prefix adders"
        ],
 		"url": "superset"
    },
 	{
        "type": "EE",
        "title": "Low-Power Multi-Core Processor",
        "tagline": "Extremely energy-efficient multi-core processor in nanoscale CMOS for media processing in portable devices",
        "description": "Dynamic voltage and frequency scaling (DVFS) lets microprocessors spend the optimal amount of energy and time to complete a task. While modern processors often boast DVFS capabilities, they can only change the voltage or frequency for the entire chip. If the chip has multiple cores, this means all cores must be on even if only one is actually doing work. The unused cores are wasting energy. Our Raven chip solves this problem by giving each core its own DC-to-DC converter and clock generator. To find out more about the project, see the <a href=\"https://bwrcs.eecs.berkeley.edu/comic/projects/design-of-extremely-energy-efficient-multi-core-processor-in-nanoscale-cmos-for-media-processing-in-portable-devices/\">ComIC website</a>. Image taken from \"Design Techniques for Fully Integrated Switched-Capacitor DC-DC Converters\" by H-P. Le, S. Sanders, and E. Alon.",
        "img_source": "images/project_multicore.png",
        "img_alt": "DC-to-DC multicore",
		"color": "green",
        "dates": "2012-Now",
		"featured": "no",
 		"documents" : [ ],
 		"url": "raven"
    },
 	{
        "type": "EE",
        "title": "Moisture Sensing ASIC",
        "tagline": "Mixed-signal moisture sensor data processor to reduce wasted crop irrigation water",
        "description": "Without knowing how much water is in their soil, farmers tend to use timed irrigation, which often uses more water than necessary. According to <a href=\"http://buildgreen.ufl.edu/Fact_sheet_Soil_Moisture_Sensors.pdf\">research</a>, measuring the moisture of farming soil can reduce the amount of water used by up to 88%. This project focused on designing the signal processing path for a capacitive moisture sensor for farming. The design uses a idealized capacitive bridge to differentially measure the water content. It processes these data by mixing the differential output and comparing it to a reference output. Finally, it uses an analog-to-digital converter to digitize the data and prepare it for transmission. The project was part of the Mixed-Signal Integrated Circuits design class at the University of Virginia, taught by Professor Travis Blalock.",
        "img_source": "images/project_mic.png",
        "img_alt": "Mixer output",
		"color": "aqua",
        "dates": "2011",
		"featured": "no",
 		"documents" : [
 			"documents/micreport.pdf|Final Project Report"
        ],
 		"url": "moisture"
	},
	{
        "type": "EE",
        "title": "Smoothed Local Percent Filter",
        "tagline": "Image processing with a smoothed local histogram percent filter in hardware",
        "description": "A local histogram filter uses the information about the neighborhood around individual pixels to process an image. By constructing a smooth, isotropic, centrally-weighted histogram for each pixel, these filters have an advantage over pre-existing histogram filters. In addition to better-looking percent filters (e.g. the median filter, erosion, dilation, etc.), such histogram filters allow new mode-based filters as well. This project focused on smoothed local percent filters. This design’s throughput was independent of neighborhood size, and a frame rate of 30 fps was easily reached with a 320x200 pixel image. The SRAMs used to buffer intermediate calculations grossly dominated the design’s metrics, but further design exploration could reduce or eliminate this hinderance. The project was part of the VLSI Systems Design class at the University of California, Berkeley, taught by Professors John Wawrzynek, Krste Asanovic, Jonathan Bachrach, and Dr. John Lazzaro.",
        "img_source": "images/project_filter.png",
        "img_alt": "Smoothed local histogram integral",
		"color": "aqua",
        "dates": "2012",
		"featured": "no",
 		"documents" : [
 		"documents/filter_report.pdf|Final Project Report"
        ],
 		"url": "percentfilter"
    },
 	{
        "type": "EE",
        "title": "Soft Errors in Datapaths",
        "tagline": "Understanding and protecting against single event transients in microprocessors",
        "description": "Modern power-constrained microprocessors reduce the operating voltage as much as possible to save energy.  However, nanoscale devices operating at low voltages are vulnerable to soft errors caused by background radiation.  Single event transients result in a voltage pulse at a particular node, which can propagate through logic and, in the worst case, cause an undetectable error in operation.  To guard against this possibility, operating voltages are increased by some additional margin.  This project will explore appropriate models and circuit techniques to guard against soft errors in logic while reducing or eliminating this margin, allowing for reduced operating power.",
        "img_source": "images/project_upset.png",
        "img_alt": "Radiation-induced current pulse",
		"color": "green",
        "dates": "2013-Now",
        "featured": "yes",
	 	"documents" : [
 			"documents/upset_proposal.pdf|Project Proposal",
            "documents/upset_midterm.pdf|Midterm Report",
            "documents/upset_final.pdf|Final Report",
            "documents/upset_presentation.pdf|Project Presentation"
         ],
 		"url": "upset"
    }
]
